Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/nxp/mimxrt1040_evk/ssh_client_demo/keil/startup_mimxrt1042.s
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;Heap_Size       EQU     0x400

;                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp  ; Top of Stack
                DCD     Reset_Handler  ; Reset Handler
                DCD     NMI_Handler                      ;NMI Handler
                DCD     HardFault_Handler                ;Hard Fault Handler
                DCD     MemManage_Handler                ;MPU Fault Handler
                DCD     BusFault_Handler                 ;Bus Fault Handler
                DCD     UsageFault_Handler               ;Usage Fault Handler
                DCD     0                                ;Reserved
                DCD     0                                ;Reserved
                DCD     0                                ;Reserved
                DCD     0                                ;Reserved
                DCD     SVC_Handler                      ;SVCall Handler
                DCD     DebugMon_Handler                 ;Debug Monitor Handler
                DCD     0                                ;Reserved
                DCD     PendSV_Handler                   ;PendSV Handler
                DCD     SysTick_Handler                  ;SysTick Handler

                                                         ;External Interrupts
                DCD     DMA0_DMA16_IRQHandler            ;DMA channel 0/16 transfer complete
                DCD     DMA1_DMA17_IRQHandler            ;DMA channel 1/17 transfer complete
                DCD     DMA2_DMA18_IRQHandler            ;DMA channel 2/18 transfer complete
                DCD     DMA3_DMA19_IRQHandler            ;DMA channel 3/19 transfer complete
                DCD     DMA4_DMA20_IRQHandler            ;DMA channel 4/20 transfer complete
                DCD     DMA5_DMA21_IRQHandler            ;DMA channel 5/21 transfer complete
                DCD     DMA6_DMA22_IRQHandler            ;DMA channel 6/22 transfer complete
                DCD     DMA7_DMA23_IRQHandler            ;DMA channel 7/23 transfer complete
                DCD     DMA8_DMA24_IRQHandler            ;DMA channel 8/24 transfer complete
                DCD     DMA9_DMA25_IRQHandler            ;DMA channel 9/25 transfer complete
                DCD     DMA10_DMA26_IRQHandler           ;DMA channel 10/26 transfer complete
                DCD     DMA11_DMA27_IRQHandler           ;DMA channel 11/27 transfer complete
                DCD     DMA12_DMA28_IRQHandler           ;DMA channel 12/28 transfer complete
                DCD     DMA13_DMA29_IRQHandler           ;DMA channel 13/29 transfer complete
                DCD     DMA14_DMA30_IRQHandler           ;DMA channel 14/30 transfer complete
                DCD     DMA15_DMA31_IRQHandler           ;DMA channel 15/31 transfer complete
                DCD     DMA_ERROR_IRQHandler             ;DMA error interrupt channels 0-15 / 16-31
                DCD     CTI0_ERROR_IRQHandler            ;CTI0_Error
                DCD     CTI1_ERROR_IRQHandler            ;CTI1_Error
                DCD     CORE_IRQHandler                  ;CorePlatform exception IRQ
                DCD     LPUART1_IRQHandler               ;LPUART1 TX interrupt and RX interrupt
                DCD     LPUART2_IRQHandler               ;LPUART2 TX interrupt and RX interrupt
                DCD     LPUART3_IRQHandler               ;LPUART3 TX interrupt and RX interrupt
                DCD     LPUART4_IRQHandler               ;LPUART4 TX interrupt and RX interrupt
                DCD     LPUART5_IRQHandler               ;LPUART5 TX interrupt and RX interrupt
                DCD     LPUART6_IRQHandler               ;LPUART6 TX interrupt and RX interrupt
                DCD     LPUART7_IRQHandler               ;LPUART7 TX interrupt and RX interrupt
                DCD     LPUART8_IRQHandler               ;LPUART8 TX interrupt and RX interrupt
                DCD     LPI2C1_IRQHandler                ;LPI2C1 interrupt
                DCD     LPI2C2_IRQHandler                ;LPI2C2 interrupt
                DCD     LPI2C3_IRQHandler                ;LPI2C3 interrupt
                DCD     LPI2C4_IRQHandler                ;LPI2C4 interrupt
                DCD     LPSPI1_IRQHandler                ;LPSPI1 single interrupt vector for all sources
                DCD     LPSPI2_IRQHandler                ;LPSPI2 single interrupt vector for all sources
                DCD     Reserved50_IRQHandler            ;Reserved interrupt
                DCD     LPSPI3_IRQHandler                ;LPSPI3 single interrupt vector for all sources
                DCD     CAN1_IRQHandler                  ;CAN1 interrupt
                DCD     CAN2_IRQHandler                  ;CAN2 interrupt
                DCD     FLEXRAM_IRQHandler               ;FlexRAM address out of range Or access hit IRQ
                DCD     Reserved55_IRQHandler            ;Reserved interrupt
                DCD     Reserved56_IRQHandler            ;Reserved interrupt
                DCD     GPR_IRQ_IRQHandler               ;GPR interrupt
                DCD     LCDIF_IRQHandler                 ;LCDIF interrupt
                DCD     Reserved59_IRQHandler            ;Reserved interrupt
                DCD     PXP_IRQHandler                   ;PXP interrupt
                DCD     WDOG2_IRQHandler                 ;WDOG2 interrupt
                DCD     SNVS_HP_WRAPPER_IRQHandler       ;SNVS Functional Interrupt
                DCD     SNVS_HP_WRAPPER_TZ_IRQHandler    ;SNVS Security Interrupt
                DCD     SNVS_LP_WRAPPER_IRQHandler       ;ON-OFF button press shorter than 5 secs (pulse event)
                DCD     CSU_IRQHandler                   ;CSU interrupt
                DCD     DCP_IRQHandler                   ;DCP_IRQ interrupt
                DCD     DCP_VMI_IRQHandler               ;DCP_VMI_IRQ interrupt
                DCD     Reserved68_IRQHandler            ;Reserved interrupt
                DCD     TRNG_IRQHandler                  ;TRNG interrupt
                DCD     Reserved70_IRQHandler            ;Reserved interrupt
                DCD     BEE_IRQHandler                   ;BEE interrupt
                DCD     SAI1_IRQHandler                  ;SAI1 interrupt
                DCD     SAI2_IRQHandler                  ;SAI1 interrupt
                DCD     SAI3_RX_IRQHandler               ;SAI3 interrupt
                DCD     SAI3_TX_IRQHandler               ;SAI3 interrupt
                DCD     SPDIF_IRQHandler                 ;SPDIF interrupt
                DCD     PMU_EVENT_IRQHandler             ;Brown-out event interrupt
                DCD     Reserved78_IRQHandler            ;Reserved interrupt
                DCD     TEMP_LOW_HIGH_IRQHandler         ;TempSensor low/high interrupt
                DCD     TEMP_PANIC_IRQHandler            ;TempSensor panic interrupt
                DCD     USB_PHY_IRQHandler               ;USBPHY (UTMI0), Interrupt
                DCD     Reserved82_IRQHandler            ;Reserved interrupt
                DCD     ADC1_IRQHandler                  ;ADC1 interrupt
                DCD     ADC2_IRQHandler                  ;ADC2 interrupt
                DCD     DCDC_IRQHandler                  ;DCDC interrupt
                DCD     Reserved86_IRQHandler            ;Reserved interrupt
                DCD     Reserved87_IRQHandler            ;Reserved interrupt
                DCD     GPIO1_INT0_IRQHandler            ;Active HIGH Interrupt from INT0 from GPIO
                DCD     GPIO1_INT1_IRQHandler            ;Active HIGH Interrupt from INT1 from GPIO
                DCD     GPIO1_INT2_IRQHandler            ;Active HIGH Interrupt from INT2 from GPIO
                DCD     GPIO1_INT3_IRQHandler            ;Active HIGH Interrupt from INT3 from GPIO
                DCD     GPIO1_INT4_IRQHandler            ;Active HIGH Interrupt from INT4 from GPIO
                DCD     GPIO1_INT5_IRQHandler            ;Active HIGH Interrupt from INT5 from GPIO
                DCD     GPIO1_INT6_IRQHandler            ;Active HIGH Interrupt from INT6 from GPIO
                DCD     GPIO1_INT7_IRQHandler            ;Active HIGH Interrupt from INT7 from GPIO
                DCD     GPIO1_Combined_0_15_IRQHandler   ;Combined interrupt indication for GPIO1 signal 0 throughout 15
                DCD     GPIO1_Combined_16_31_IRQHandler  ;Combined interrupt indication for GPIO1 signal 16 throughout 31
                DCD     GPIO2_Combined_0_15_IRQHandler   ;Combined interrupt indication for GPIO2 signal 0 throughout 15
                DCD     GPIO2_Combined_16_31_IRQHandler  ;Combined interrupt indication for GPIO2 signal 16 throughout 31
                DCD     GPIO3_Combined_0_15_IRQHandler   ;Combined interrupt indication for GPIO3 signal 0 throughout 15
                DCD     GPIO3_Combined_16_31_IRQHandler  ;Combined interrupt indication for GPIO3 signal 16 throughout 31
                DCD     GPIO4_Combined_0_15_IRQHandler   ;Combined interrupt indication for GPIO4 signal 0 throughout 15
                DCD     GPIO4_Combined_16_31_IRQHandler  ;Combined interrupt indication for GPIO4 signal 16 throughout 31
                DCD     GPIO5_Combined_0_15_IRQHandler   ;Combined interrupt indication for GPIO5 signal 0 throughout 15
                DCD     GPIO5_Combined_16_31_IRQHandler  ;Combined interrupt indication for GPIO5 signal 16 throughout 31
                DCD     FLEXIO1_IRQHandler               ;FLEXIO1 interrupt
                DCD     FLEXIO2_IRQHandler               ;FLEXIO2 interrupt
                DCD     WDOG1_IRQHandler                 ;WDOG1 interrupt
                DCD     RTWDOG_IRQHandler                ;RTWDOG interrupt
                DCD     EWM_IRQHandler                   ;EWM interrupt
                DCD     CCM_1_IRQHandler                 ;CCM IRQ1 interrupt
                DCD     CCM_2_IRQHandler                 ;CCM IRQ2 interrupt
                DCD     GPC_IRQHandler                   ;GPC interrupt
                DCD     SRC_IRQHandler                   ;SRC interrupt
                DCD     Reserved115_IRQHandler           ;Reserved interrupt
                DCD     GPT1_IRQHandler                  ;GPT1 interrupt
                DCD     GPT2_IRQHandler                  ;GPT2 interrupt
                DCD     PWM1_0_IRQHandler                ;PWM1 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM1_1_IRQHandler                ;PWM1 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM1_2_IRQHandler                ;PWM1 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM1_3_IRQHandler                ;PWM1 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM1_FAULT_IRQHandler            ;PWM1 fault or reload error interrupt
                DCD     FLEXSPI2_IRQHandler              ;FlexSPI2 interrupt
                DCD     FLEXSPI_IRQHandler               ;FlexSPI interrupt
                DCD     SEMC_IRQHandler                  ;SEMC interrupt
                DCD     USDHC1_IRQHandler                ;USDHC1 interrupt
                DCD     USDHC2_IRQHandler                ;USDHC2 interrupt
                DCD     Reserved112_IRQHandler           ;Reserved interrupt
                DCD     USB_OTG_IRQHandler               ;USBO2 USB OTG
                DCD     ENET_IRQHandler                  ;ENET interrupt
                DCD     ENET_1588_Timer_IRQHandler       ;ENET_1588_Timer interrupt
                DCD     XBAR1_IRQ_0_1_IRQHandler         ;XBARA1 output signal 0, 1 interrupt
                DCD     XBAR1_IRQ_2_3_IRQHandler         ;XBARA1 output signal 2, 3 interrupt
                DCD     ADC_ETC_IRQ0_IRQHandler          ;ADCETC IRQ0 interrupt
                DCD     ADC_ETC_IRQ1_IRQHandler          ;ADCETC IRQ1 interrupt
                DCD     ADC_ETC_IRQ2_IRQHandler          ;ADCETC IRQ2 interrupt
                DCD     ADC_ETC_ERROR_IRQ_IRQHandler     ;ADCETC Error IRQ interrupt
                DCD     PIT_IRQHandler                   ;PIT interrupt
                DCD     ACMP1_IRQHandler                 ;ACMP interrupt
                DCD     ACMP2_IRQHandler                 ;ACMP interrupt
                DCD     ACMP3_IRQHandler                 ;ACMP interrupt
                DCD     ACMP4_IRQHandler                 ;ACMP interrupt
                DCD     Reserved143_IRQHandler           ;Reserved interrupt
                DCD     Reserved144_IRQHandler           ;Reserved interrupt
                DCD     ENC1_IRQHandler                  ;ENC1 interrupt
                DCD     ENC2_IRQHandler                  ;ENC2 interrupt
                DCD     ENC3_IRQHandler                  ;ENC3 interrupt
                DCD     ENC4_IRQHandler                  ;ENC4 interrupt
                DCD     TMR1_IRQHandler                  ;TMR1 interrupt
                DCD     TMR2_IRQHandler                  ;TMR2 interrupt
                DCD     TMR3_IRQHandler                  ;TMR3 interrupt
                DCD     TMR4_IRQHandler                  ;TMR4 interrupt
                DCD     PWM2_0_IRQHandler                ;PWM2 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM2_1_IRQHandler                ;PWM2 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM2_2_IRQHandler                ;PWM2 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM2_3_IRQHandler                ;PWM2 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM2_FAULT_IRQHandler            ;PWM2 fault or reload error interrupt
                DCD     PWM3_0_IRQHandler                ;PWM3 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM3_1_IRQHandler                ;PWM3 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM3_2_IRQHandler                ;PWM3 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM3_3_IRQHandler                ;PWM3 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM3_FAULT_IRQHandler            ;PWM3 fault or reload error interrupt
                DCD     PWM4_0_IRQHandler                ;PWM4 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM4_1_IRQHandler                ;PWM4 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM4_2_IRQHandler                ;PWM4 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM4_3_IRQHandler                ;PWM4 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM4_FAULT_IRQHandler            ;PWM4 fault or reload error interrupt
                DCD     Reserved168_IRQHandler           ;Reserved interrupt
                DCD     Reserved169_IRQHandler           ;Reserved interrupt
                DCD     CAN3_IRQHandler                  ;CAN3 interrupt
                DCD     Reserved171_IRQHandler           ;Reserved interrupt
                DCD     FLEXIO3_IRQHandler               ;FLEXIO3 interrupt
                DCD     GPIO6_7_8_9_IRQHandler           ;GPIO6, GPIO7, GPIO8, GPIO9 interrupt
                DCD     DefaultISR                       ;174
                DCD     DefaultISR                       ;175
                DCD     DefaultISR                       ;176
                DCD     DefaultISR                       ;177
                DCD     DefaultISR                       ;178
                DCD     DefaultISR                       ;179
                DCD     DefaultISR                       ;180
                DCD     DefaultISR                       ;181
                DCD     DefaultISR                       ;182
                DCD     DefaultISR                       ;183
                DCD     DefaultISR                       ;184
                DCD     DefaultISR                       ;185
                DCD     DefaultISR                       ;186
                DCD     DefaultISR                       ;187
                DCD     DefaultISR                       ;188
                DCD     DefaultISR                       ;189
                DCD     DefaultISR                       ;190
                DCD     DefaultISR                       ;191
                DCD     DefaultISR                       ;192
                DCD     DefaultISR                       ;193
                DCD     DefaultISR                       ;194
                DCD     DefaultISR                       ;195
                DCD     DefaultISR                       ;196
                DCD     DefaultISR                       ;197
                DCD     DefaultISR                       ;198
                DCD     DefaultISR                       ;199
                DCD     DefaultISR                       ;200
                DCD     DefaultISR                       ;201
                DCD     DefaultISR                       ;202
                DCD     DefaultISR                       ;203
                DCD     DefaultISR                       ;204
                DCD     DefaultISR                       ;205
                DCD     DefaultISR                       ;206
                DCD     DefaultISR                       ;207
                DCD     DefaultISR                       ;208
                DCD     DefaultISR                       ;209
                DCD     DefaultISR                       ;210
                DCD     DefaultISR                       ;211
                DCD     DefaultISR                       ;212
                DCD     DefaultISR                       ;213
                DCD     DefaultISR                       ;214
                DCD     DefaultISR                       ;215
                DCD     DefaultISR                       ;216
                DCD     DefaultISR                       ;217
                DCD     DefaultISR                       ;218
                DCD     DefaultISR                       ;219
                DCD     DefaultISR                       ;220
                DCD     DefaultISR                       ;221
                DCD     DefaultISR                       ;222
                DCD     DefaultISR                       ;223
                DCD     DefaultISR                       ;224
                DCD     DefaultISR                       ;225
                DCD     DefaultISR                       ;226
                DCD     DefaultISR                       ;227
                DCD     DefaultISR                       ;228
                DCD     DefaultISR                       ;229
                DCD     DefaultISR                       ;230
                DCD     DefaultISR                       ;231
                DCD     DefaultISR                       ;232
                DCD     DefaultISR                       ;233
                DCD     DefaultISR                       ;234
                DCD     DefaultISR                       ;235
                DCD     DefaultISR                       ;236
                DCD     DefaultISR                       ;237
                DCD     DefaultISR                       ;238
                DCD     DefaultISR                       ;239
                DCD     DefaultISR                       ;240
                DCD     DefaultISR                       ;241
                DCD     DefaultISR                       ;242
                DCD     DefaultISR                       ;243
                DCD     DefaultISR                       ;244
                DCD     DefaultISR                       ;245
                DCD     DefaultISR                       ;246
                DCD     DefaultISR                       ;247
                DCD     DefaultISR                       ;248
                DCD     DefaultISR                       ;249
                DCD     DefaultISR                       ;250
                DCD     DefaultISR                       ;251
                DCD     DefaultISR                       ;252
                DCD     DefaultISR                       ;253
                DCD     DefaultISR                       ;254
                DCD     0xFFFFFFFF                       ; Reserved for user TRIM value
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

