Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/nxp/mimxrt1040_evk/ssh_client_demo/keil/startup_mimxrt1042.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                CPSID   I               ; Mask interrupts
                LDR     R0, =0xE000ED08
                LDR     R1, =__Vectors
                STR     R1, [R0]
                LDR     R2, [R1]
                MSR     MSP, R2
                LDR     R0, =SystemInit
                BLX     R0
                CPSIE   i               ; Unmask interrupts
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)
NMI_Handler\
                PROC
                EXPORT  NMI_Handler         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler         [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler         [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler         [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler         [WEAK]
                B       .
                ENDP

Default_Handler\
                PROC
                EXPORT  DMA0_DMA16_IRQHandler            [WEAK]
                EXPORT  DMA1_DMA17_IRQHandler            [WEAK]
                EXPORT  DMA2_DMA18_IRQHandler            [WEAK]
                EXPORT  DMA3_DMA19_IRQHandler            [WEAK]
                EXPORT  DMA4_DMA20_IRQHandler            [WEAK]
                EXPORT  DMA5_DMA21_IRQHandler            [WEAK]
                EXPORT  DMA6_DMA22_IRQHandler            [WEAK]
                EXPORT  DMA7_DMA23_IRQHandler            [WEAK]
                EXPORT  DMA8_DMA24_IRQHandler            [WEAK]
                EXPORT  DMA9_DMA25_IRQHandler            [WEAK]
                EXPORT  DMA10_DMA26_IRQHandler           [WEAK]
                EXPORT  DMA11_DMA27_IRQHandler           [WEAK]
                EXPORT  DMA12_DMA28_IRQHandler           [WEAK]
                EXPORT  DMA13_DMA29_IRQHandler           [WEAK]
                EXPORT  DMA14_DMA30_IRQHandler           [WEAK]
                EXPORT  DMA15_DMA31_IRQHandler           [WEAK]
                EXPORT  DMA_ERROR_IRQHandler             [WEAK]
                EXPORT  CTI0_ERROR_IRQHandler            [WEAK]
                EXPORT  CTI1_ERROR_IRQHandler            [WEAK]
                EXPORT  CORE_IRQHandler                  [WEAK]
                EXPORT  LPUART1_IRQHandler               [WEAK]
                EXPORT  LPUART2_IRQHandler               [WEAK]
                EXPORT  LPUART3_IRQHandler               [WEAK]
                EXPORT  LPUART4_IRQHandler               [WEAK]
                EXPORT  LPUART5_IRQHandler               [WEAK]
                EXPORT  LPUART6_IRQHandler               [WEAK]
                EXPORT  LPUART7_IRQHandler               [WEAK]
                EXPORT  LPUART8_IRQHandler               [WEAK]
                EXPORT  LPI2C1_IRQHandler                [WEAK]
                EXPORT  LPI2C2_IRQHandler                [WEAK]
                EXPORT  LPI2C3_IRQHandler                [WEAK]
                EXPORT  LPI2C4_IRQHandler                [WEAK]
                EXPORT  LPSPI1_IRQHandler                [WEAK]
                EXPORT  LPSPI2_IRQHandler                [WEAK]
                EXPORT  Reserved50_IRQHandler            [WEAK]
                EXPORT  LPSPI3_IRQHandler                [WEAK]
                EXPORT  CAN1_IRQHandler                  [WEAK]
                EXPORT  CAN2_IRQHandler                  [WEAK]
                EXPORT  FLEXRAM_IRQHandler               [WEAK]
                EXPORT  Reserved55_IRQHandler            [WEAK]
                EXPORT  Reserved56_IRQHandler            [WEAK]
                EXPORT  GPR_IRQ_IRQHandler               [WEAK]
                EXPORT  LCDIF_IRQHandler                 [WEAK]
                EXPORT  Reserved59_IRQHandler            [WEAK]
                EXPORT  PXP_IRQHandler                   [WEAK]
                EXPORT  WDOG2_IRQHandler                 [WEAK]
                EXPORT  SNVS_HP_WRAPPER_IRQHandler       [WEAK]
                EXPORT  SNVS_HP_WRAPPER_TZ_IRQHandler    [WEAK]
                EXPORT  SNVS_LP_WRAPPER_IRQHandler       [WEAK]
                EXPORT  CSU_IRQHandler                   [WEAK]
                EXPORT  DCP_IRQHandler                   [WEAK]
                EXPORT  DCP_VMI_IRQHandler               [WEAK]
                EXPORT  Reserved68_IRQHandler            [WEAK]
                EXPORT  TRNG_IRQHandler                  [WEAK]
                EXPORT  Reserved70_IRQHandler            [WEAK]
                EXPORT  BEE_IRQHandler                   [WEAK]
                EXPORT  SAI1_IRQHandler                  [WEAK]
                EXPORT  SAI2_IRQHandler                  [WEAK]
                EXPORT  SAI3_RX_IRQHandler               [WEAK]
                EXPORT  SAI3_TX_IRQHandler               [WEAK]
                EXPORT  SPDIF_IRQHandler                 [WEAK]
                EXPORT  PMU_EVENT_IRQHandler             [WEAK]
                EXPORT  Reserved78_IRQHandler            [WEAK]
                EXPORT  TEMP_LOW_HIGH_IRQHandler         [WEAK]
                EXPORT  TEMP_PANIC_IRQHandler            [WEAK]
                EXPORT  USB_PHY_IRQHandler               [WEAK]
                EXPORT  Reserved82_IRQHandler            [WEAK]
                EXPORT  ADC1_IRQHandler                  [WEAK]
                EXPORT  ADC2_IRQHandler                  [WEAK]
                EXPORT  DCDC_IRQHandler                  [WEAK]
                EXPORT  Reserved86_IRQHandler            [WEAK]
                EXPORT  Reserved87_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT0_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT1_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT2_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT3_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT4_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT5_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT6_IRQHandler            [WEAK]
                EXPORT  GPIO1_INT7_IRQHandler            [WEAK]
                EXPORT  GPIO1_Combined_0_15_IRQHandler   [WEAK]
                EXPORT  GPIO1_Combined_16_31_IRQHandler  [WEAK]
                EXPORT  GPIO2_Combined_0_15_IRQHandler   [WEAK]
                EXPORT  GPIO2_Combined_16_31_IRQHandler  [WEAK]
                EXPORT  GPIO3_Combined_0_15_IRQHandler   [WEAK]
                EXPORT  GPIO3_Combined_16_31_IRQHandler  [WEAK]
                EXPORT  GPIO4_Combined_0_15_IRQHandler   [WEAK]
                EXPORT  GPIO4_Combined_16_31_IRQHandler  [WEAK]
                EXPORT  GPIO5_Combined_0_15_IRQHandler   [WEAK]
                EXPORT  GPIO5_Combined_16_31_IRQHandler  [WEAK]
                EXPORT  FLEXIO1_IRQHandler               [WEAK]
                EXPORT  FLEXIO2_IRQHandler               [WEAK]
                EXPORT  WDOG1_IRQHandler                 [WEAK]
                EXPORT  RTWDOG_IRQHandler                [WEAK]
                EXPORT  EWM_IRQHandler                   [WEAK]
                EXPORT  CCM_1_IRQHandler                 [WEAK]
                EXPORT  CCM_2_IRQHandler                 [WEAK]
                EXPORT  GPC_IRQHandler                   [WEAK]
                EXPORT  SRC_IRQHandler                   [WEAK]
                EXPORT  Reserved115_IRQHandler           [WEAK]
                EXPORT  GPT1_IRQHandler                  [WEAK]
                EXPORT  GPT2_IRQHandler                  [WEAK]
                EXPORT  PWM1_0_IRQHandler                [WEAK]
                EXPORT  PWM1_1_IRQHandler                [WEAK]
                EXPORT  PWM1_2_IRQHandler                [WEAK]
                EXPORT  PWM1_3_IRQHandler                [WEAK]
                EXPORT  PWM1_FAULT_IRQHandler            [WEAK]
                EXPORT  FLEXSPI2_IRQHandler              [WEAK]
                EXPORT  FLEXSPI_IRQHandler               [WEAK]
                EXPORT  SEMC_IRQHandler                  [WEAK]
                EXPORT  USDHC1_IRQHandler                [WEAK]
                EXPORT  USDHC2_IRQHandler                [WEAK]
                EXPORT  Reserved112_IRQHandler           [WEAK]
                EXPORT  USB_OTG_IRQHandler               [WEAK]
                EXPORT  ENET_IRQHandler                  [WEAK]
                EXPORT  ENET_1588_Timer_IRQHandler       [WEAK]
                EXPORT  XBAR1_IRQ_0_1_IRQHandler         [WEAK]
                EXPORT  XBAR1_IRQ_2_3_IRQHandler         [WEAK]
                EXPORT  ADC_ETC_IRQ0_IRQHandler          [WEAK]
                EXPORT  ADC_ETC_IRQ1_IRQHandler          [WEAK]
                EXPORT  ADC_ETC_IRQ2_IRQHandler          [WEAK]
                EXPORT  ADC_ETC_ERROR_IRQ_IRQHandler     [WEAK]
                EXPORT  PIT_IRQHandler                   [WEAK]
                EXPORT  ACMP1_IRQHandler                 [WEAK]
                EXPORT  ACMP2_IRQHandler                 [WEAK]
                EXPORT  ACMP3_IRQHandler                 [WEAK]
                EXPORT  ACMP4_IRQHandler                 [WEAK]
                EXPORT  Reserved143_IRQHandler           [WEAK]
                EXPORT  Reserved144_IRQHandler           [WEAK]
                EXPORT  ENC1_IRQHandler                  [WEAK]
                EXPORT  ENC2_IRQHandler                  [WEAK]
                EXPORT  ENC3_IRQHandler                  [WEAK]
                EXPORT  ENC4_IRQHandler                  [WEAK]
                EXPORT  TMR1_IRQHandler                  [WEAK]
                EXPORT  TMR2_IRQHandler                  [WEAK]
                EXPORT  TMR3_IRQHandler                  [WEAK]
                EXPORT  TMR4_IRQHandler                  [WEAK]
                EXPORT  PWM2_0_IRQHandler                [WEAK]
                EXPORT  PWM2_1_IRQHandler                [WEAK]
                EXPORT  PWM2_2_IRQHandler                [WEAK]
                EXPORT  PWM2_3_IRQHandler                [WEAK]
                EXPORT  PWM2_FAULT_IRQHandler            [WEAK]
                EXPORT  PWM3_0_IRQHandler                [WEAK]
                EXPORT  PWM3_1_IRQHandler                [WEAK]
                EXPORT  PWM3_2_IRQHandler                [WEAK]
                EXPORT  PWM3_3_IRQHandler                [WEAK]
                EXPORT  PWM3_FAULT_IRQHandler            [WEAK]
                EXPORT  PWM4_0_IRQHandler                [WEAK]
                EXPORT  PWM4_1_IRQHandler                [WEAK]
                EXPORT  PWM4_2_IRQHandler                [WEAK]
                EXPORT  PWM4_3_IRQHandler                [WEAK]
                EXPORT  PWM4_FAULT_IRQHandler            [WEAK]
                EXPORT  Reserved168_IRQHandler           [WEAK]
                EXPORT  Reserved169_IRQHandler           [WEAK]
                EXPORT  CAN3_IRQHandler                  [WEAK]
                EXPORT  Reserved171_IRQHandler           [WEAK]
                EXPORT  FLEXIO3_IRQHandler               [WEAK]
                EXPORT  GPIO6_7_8_9_IRQHandler           [WEAK]
                EXPORT  DefaultISR                          [WEAK]
DMA0_DMA16_IRQHandler
DMA1_DMA17_IRQHandler
DMA2_DMA18_IRQHandler
DMA3_DMA19_IRQHandler
DMA4_DMA20_IRQHandler
DMA5_DMA21_IRQHandler
DMA6_DMA22_IRQHandler
DMA7_DMA23_IRQHandler
DMA8_DMA24_IRQHandler
DMA9_DMA25_IRQHandler
DMA10_DMA26_IRQHandler
DMA11_DMA27_IRQHandler
DMA12_DMA28_IRQHandler
DMA13_DMA29_IRQHandler
DMA14_DMA30_IRQHandler
DMA15_DMA31_IRQHandler
DMA_ERROR_IRQHandler
CTI0_ERROR_IRQHandler
CTI1_ERROR_IRQHandler
CORE_IRQHandler
LPUART1_IRQHandler
LPUART2_IRQHandler
LPUART3_IRQHandler
LPUART4_IRQHandler
LPUART5_IRQHandler
LPUART6_IRQHandler
LPUART7_IRQHandler
LPUART8_IRQHandler
LPI2C1_IRQHandler
LPI2C2_IRQHandler
LPI2C3_IRQHandler
LPI2C4_IRQHandler
LPSPI1_IRQHandler
LPSPI2_IRQHandler
Reserved50_IRQHandler
LPSPI3_IRQHandler
CAN1_IRQHandler
CAN2_IRQHandler
FLEXRAM_IRQHandler
Reserved55_IRQHandler
Reserved56_IRQHandler
GPR_IRQ_IRQHandler
LCDIF_IRQHandler
Reserved59_IRQHandler
PXP_IRQHandler
WDOG2_IRQHandler
SNVS_HP_WRAPPER_IRQHandler
SNVS_HP_WRAPPER_TZ_IRQHandler
SNVS_LP_WRAPPER_IRQHandler
CSU_IRQHandler
DCP_IRQHandler
DCP_VMI_IRQHandler
Reserved68_IRQHandler
TRNG_IRQHandler
Reserved70_IRQHandler
BEE_IRQHandler
SAI1_IRQHandler
SAI2_IRQHandler
SAI3_RX_IRQHandler
SAI3_TX_IRQHandler
SPDIF_IRQHandler
PMU_EVENT_IRQHandler
Reserved78_IRQHandler
TEMP_LOW_HIGH_IRQHandler
TEMP_PANIC_IRQHandler
USB_PHY_IRQHandler
Reserved82_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
DCDC_IRQHandler
Reserved86_IRQHandler
Reserved87_IRQHandler
GPIO1_INT0_IRQHandler
GPIO1_INT1_IRQHandler
GPIO1_INT2_IRQHandler
GPIO1_INT3_IRQHandler
GPIO1_INT4_IRQHandler
GPIO1_INT5_IRQHandler
GPIO1_INT6_IRQHandler
GPIO1_INT7_IRQHandler
GPIO1_Combined_0_15_IRQHandler
GPIO1_Combined_16_31_IRQHandler
GPIO2_Combined_0_15_IRQHandler
GPIO2_Combined_16_31_IRQHandler
GPIO3_Combined_0_15_IRQHandler
GPIO3_Combined_16_31_IRQHandler
GPIO4_Combined_0_15_IRQHandler
GPIO4_Combined_16_31_IRQHandler
GPIO5_Combined_0_15_IRQHandler
GPIO5_Combined_16_31_IRQHandler
FLEXIO1_IRQHandler
FLEXIO2_IRQHandler
WDOG1_IRQHandler
RTWDOG_IRQHandler
EWM_IRQHandler
CCM_1_IRQHandler
CCM_2_IRQHandler
GPC_IRQHandler
SRC_IRQHandler
Reserved115_IRQHandler
GPT1_IRQHandler
GPT2_IRQHandler
PWM1_0_IRQHandler
PWM1_1_IRQHandler
PWM1_2_IRQHandler
PWM1_3_IRQHandler
PWM1_FAULT_IRQHandler
FLEXSPI2_IRQHandler
FLEXSPI_IRQHandler
SEMC_IRQHandler
USDHC1_IRQHandler
USDHC2_IRQHandler
Reserved112_IRQHandler
USB_OTG_IRQHandler
ENET_IRQHandler
ENET_1588_Timer_IRQHandler
XBAR1_IRQ_0_1_IRQHandler
XBAR1_IRQ_2_3_IRQHandler
ADC_ETC_IRQ0_IRQHandler
ADC_ETC_IRQ1_IRQHandler
ADC_ETC_IRQ2_IRQHandler
ADC_ETC_ERROR_IRQ_IRQHandler
PIT_IRQHandler
ACMP1_IRQHandler
ACMP2_IRQHandler
ACMP3_IRQHandler
ACMP4_IRQHandler
Reserved143_IRQHandler
Reserved144_IRQHandler
ENC1_IRQHandler
ENC2_IRQHandler
ENC3_IRQHandler
ENC4_IRQHandler
TMR1_IRQHandler
TMR2_IRQHandler
TMR3_IRQHandler
TMR4_IRQHandler
PWM2_0_IRQHandler
PWM2_1_IRQHandler
PWM2_2_IRQHandler
PWM2_3_IRQHandler
PWM2_FAULT_IRQHandler
PWM3_0_IRQHandler
PWM3_1_IRQHandler
PWM3_2_IRQHandler
PWM3_3_IRQHandler
PWM3_FAULT_IRQHandler
PWM4_0_IRQHandler
PWM4_1_IRQHandler
PWM4_2_IRQHandler
PWM4_3_IRQHandler
PWM4_FAULT_IRQHandler
Reserved168_IRQHandler
Reserved169_IRQHandler
CAN3_IRQHandler
Reserved171_IRQHandler
FLEXIO3_IRQHandler
GPIO6_7_8_9_IRQHandler
DefaultISR
                LDR    R0, =DefaultISR
                BX     R0
                ENDP

                  ALIGN


; User Initial Stack & Heap

;                IF      :DEF:__MICROLIB

;                EXPORT  __initial_sp
;                EXPORT  __heap_base
;                EXPORT  __heap_limit

;                ELSE

;                IMPORT  __use_two_region_memory
;                EXPORT  __user_initial_stackheap
;__user_initial_stackheap

;                LDR     R0, =  Heap_Mem
;                LDR     R1, =(Stack_Mem + Stack_Size)
;                LDR     R2, = (Heap_Mem +  Heap_Size)
;                LDR     R3, = Stack_Mem
;                BX      LR

;                ALIGN

;                ENDIF


                END
